_posts/2022-02-04-boj-2981.html
---
title: BOJ 2981 검문
tags: 수학
---

<div id="outline-container-orgd133cd0" class="outline-2">
<h2 id="orgd133cd0">BOJ 2981 검문</h2>
</div>
<div id="outline-container-org2908174" class="outline-2">
<h2 id="org2908174">접근하기</h2>
<div class="outline-text-2" id="text-org2908174">
<pre class="example">
A = aM + r
B = bM + r
C = cM + r
...

B - A = (b - a)xM      (r이 소거됨)
C - B = (c - b)xM      (r이 소거됨)
...

gcd( B-A, C-B, D-C, ...) -&gt;최대공약수

최대공약수의 약수 -&gt; 공약수의 목록
</pre>
</div>
</div>
<div id="outline-container-org7290abd" class="outline-2">
<h2 id="org7290abd">코드</h2>
<div class="outline-text-2" id="text-org7290abd">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[110];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">gcd</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (b == 0)
        <span style="color: #729fcf; font-weight: bold;">return</span> a;
    <span style="color: #729fcf; font-weight: bold;">else</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> gcd(b, a%b);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
<span style="color: #729fcf;">#if</span><span style="color: #729fcf;">n</span><span style="color: #729fcf;">def</span> ONLINE_JUDGE
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
    <span style="color: #ff6347;">freopen</span>(<span style="color: #ad7fa8; font-style: italic;">"input2.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
<span style="color: #729fcf;">#endif</span>
    cin &gt;&gt; N;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cin &gt;&gt; a[i];
    }
    sort(a, a+N);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cur</span> = a[1] - a[0];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i&lt;N;i++) {
        cur = gcd(cur, a[i] - a[i-1]);
    }

    <span style="color: #8ae234; font-weight: bold;">set</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">sp</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i*i&lt;=cur;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (cur%i == 0) {
            sp.insert(i);
            sp.insert(cur/i);
        }
    }
    sp.insert(cur);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">o</span>:sp) {
        cout &lt;&lt; o &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
    }
    cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6c3712" class="outline-2">
<h2 id="orgd6c3712">해설 참고</h2>
<div class="outline-text-2" id="text-orgd6c3712">
<ul class="org-ul">
<li><a href="https://kjwan4435.tistory.com/59">https://kjwan4435.tistory.com/59</a></li>
</ul>
</div>
</div>

<div id="outline-container-org24fb7ee" class="outline-2">
<h2 id="org24fb7ee">문제 링크</h2>
<div class="outline-text-2" id="text-org24fb7ee">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2981">https://www.acmicpc.net/problem/2981</a></li>
</ul>
</div>
</div>
